; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v2)
             (pred_7 ?v5 ?v1)
             (pred_8 ?v8 ?v1)
             (pred_6 ?v3 ?v8 )
	     (pred_11 ?v8)
             (pred_10 ?v13)
             (pred_3 ?v5)
             (pred_12 ?v1)
             (pred_5 ?v8)
             (pred_4 ?v5)
             (pred_1 ?v8)
             (pred_9 ))



(:action op_2
:parameters (?v11 ?v7 ?v9 ?v4)
:precondition (and (pred_10 ?v11) (pred_10 ?v7) (pred_3 ?v9) (pred_12 ?v4)
          (pred_2 ?v11 ?v7) (pred_7 ?v9 ?v4)
                   (pred_8 ?v7 ?v4) (pred_11 ?v11) 
                   (pred_5 ?v7) (pred_4 ?v9))
:effect (and  (pred_1 ?v7) (not (pred_5 ?v7))))


(:action op_5
:parameters (?v11 ?v6)
:precondition (and (pred_10 ?v11) (pred_10 ?v6)
               (pred_11 ?v11) (pred_2 ?v11 ?v6) (pred_1 ?v6))
:effect (and (pred_11 ?v6) (not (pred_11 ?v11))))

(:action op_3
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_3 ?v9) 
                  (pred_11 ?v11) (pred_6 ?v9 ?v11) (pred_9 ))
:effect (and (pred_4 ?v9)
   (not (pred_6 ?v9 ?v11)) (not (pred_9 ))))


(:action op_1
:parameters (?v11 ?v10 ?v12)
:precondition (and (pred_10 ?v11) (pred_3 ?v10) (pred_3 ?v12)
                  (pred_11 ?v11) (pred_4 ?v12) (pred_6 ?v10 ?v11))
:effect (and (pred_4 ?v10) (pred_6 ?v12 ?v11)
        (not (pred_4 ?v12)) (not (pred_6 ?v10 ?v11))))

(:action op_4
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_3 ?v9) 
                  (pred_11 ?v11) (pred_4 ?v9))
:effect (and (pred_9 ) (pred_6 ?v9 ?v11) (not (pred_4 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_12 obj_23 obj_21 obj_08 obj_10 obj_18 obj_28 obj_19 obj_16 obj_09 obj_31 obj_22 obj_02 obj_11 obj_26 obj_27 obj_06 obj_20 obj_14 obj_24 obj_15 obj_25 obj_17 obj_29
    obj_30 obj_05 obj_01
    obj_13 obj_03 obj_04
    )

    (:init
       (pred_9)

       (pred_10 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_23)
       (pred_10 obj_21)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_18)
       (pred_10 obj_28)
       (pred_10 obj_19)
       (pred_10 obj_16)
       (pred_10 obj_09)
       (pred_10 obj_31)
       (pred_10 obj_22)
       (pred_10 obj_02)
       (pred_10 obj_11)
       (pred_10 obj_26)
       (pred_10 obj_27)
       (pred_10 obj_06)
       (pred_10 obj_20)
       (pred_10 obj_14)
       (pred_10 obj_24)
       (pred_10 obj_15)
       (pred_10 obj_25)
       (pred_10 obj_17)
       (pred_10 obj_29)
       (pred_12 obj_30)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_3 obj_13)
       (pred_3 obj_03)
       (pred_3 obj_04)

       (pred_2 obj_07 obj_10)
       (pred_2 obj_07 obj_12)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_12 obj_23)
       (pred_2 obj_12 obj_07)
       (pred_2 obj_23 obj_28)
       (pred_2 obj_23 obj_21)
       (pred_2 obj_23 obj_12)
       (pred_2 obj_21 obj_19)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_23)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_10 obj_09)
       (pred_2 obj_10 obj_18)
       (pred_2 obj_10 obj_07)
       (pred_2 obj_18 obj_31)
       (pred_2 obj_18 obj_28)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_18 obj_10)
       (pred_2 obj_28 obj_22)
       (pred_2 obj_28 obj_19)
       (pred_2 obj_28 obj_23)
       (pred_2 obj_28 obj_18)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_21)
       (pred_2 obj_19 obj_28)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_09 obj_26)
       (pred_2 obj_09 obj_31)
       (pred_2 obj_09 obj_10)
       (pred_2 obj_31 obj_27)
       (pred_2 obj_31 obj_22)
       (pred_2 obj_31 obj_18)
       (pred_2 obj_31 obj_09)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_22 obj_28)
       (pred_2 obj_22 obj_31)
       (pred_2 obj_02 obj_20)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_02 obj_22)
       (pred_2 obj_11 obj_14)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_26 obj_24)
       (pred_2 obj_26 obj_27)
       (pred_2 obj_26 obj_09)
       (pred_2 obj_27 obj_15)
       (pred_2 obj_27 obj_06)
       (pred_2 obj_27 obj_31)
       (pred_2 obj_27 obj_26)
       (pred_2 obj_06 obj_25)
       (pred_2 obj_06 obj_20)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_06 obj_27)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_02)
       (pred_2 obj_20 obj_06)
       (pred_2 obj_14 obj_29)
       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_24 obj_15)
       (pred_2 obj_24 obj_26)
       (pred_2 obj_15 obj_25)
       (pred_2 obj_15 obj_27)
       (pred_2 obj_15 obj_24)
       (pred_2 obj_25 obj_17)
       (pred_2 obj_25 obj_06)
       (pred_2 obj_25 obj_15)
       (pred_2 obj_17 obj_29)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_25)
       (pred_2 obj_29 obj_14)
       (pred_2 obj_29 obj_17)
       (pred_5 obj_29)
       (pred_5 obj_19)
       (pred_5 obj_06)
       (pred_8  obj_29 obj_30)
       (pred_8  obj_19 obj_05)
       (pred_8  obj_06 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_23)
       (pred_1 obj_21)
       (pred_1 obj_08)
       (pred_1 obj_10)
       (pred_1 obj_18)
       (pred_1 obj_28)
       (pred_1 obj_16)
       (pred_1 obj_09)
       (pred_1 obj_31)
       (pred_1 obj_22)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_26)
       (pred_1 obj_27)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_1 obj_24)
       (pred_1 obj_15)
       (pred_1 obj_25)
       (pred_1 obj_17)

       (pred_7  obj_13 obj_30)
       (pred_7  obj_03 obj_05)
       (pred_7  obj_04 obj_01)
       (pred_6 obj_13 obj_14)
       (pred_6 obj_03 obj_27)
       (pred_6 obj_04 obj_09)
       (pred_11 obj_25)
    )

    (:goal (and
       (pred_6 obj_03 obj_07)
       (pred_6 obj_04 obj_15)
    ))
(:constraints
  (always (not (pred_11 obj_31)))
)
)

; plan
1. (op_5 obj_25 obj_15)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_15)
   goals met: 0 of 2
2. (op_5 obj_15 obj_24)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_24)
   goals met: 0 of 2
3. (op_5 obj_24 obj_26)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_26)
   goals met: 0 of 2
4. (op_5 obj_26 obj_09)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_09)
   goals met: 0 of 2
5. (op_3 obj_09 obj_04)
   deleted: (pred_6 obj_04 obj_09) (pred_9)
   added: (pred_4 obj_04)
   goals met: 0 of 2
6. (op_5 obj_09 obj_26)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_26)
   goals met: 0 of 2
7. (op_5 obj_26 obj_27)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_27)
   goals met: 0 of 2
8. (op_5 obj_27 obj_15)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_15)
   goals met: 0 of 2
9. (op_4 obj_15 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_9) (pred_6 obj_04 obj_15)
   goals met: 1 of 2
10. (op_5 obj_15 obj_27)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_27)
   goals met: 1 of 2
11. (op_3 obj_27 obj_03)
   deleted: (pred_6 obj_03 obj_27) (pred_9)
   added: (pred_4 obj_03)
   goals met: 1 of 2
12. (op_5 obj_27 obj_26)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_26)
   goals met: 1 of 2
13. (op_5 obj_26 obj_09)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_09)
   goals met: 1 of 2
14. (op_5 obj_09 obj_10)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_10)
   goals met: 1 of 2
15. (op_5 obj_10 obj_07)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_07)
   goals met: 1 of 2
16. (op_4 obj_07 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_9) (pred_6 obj_03 obj_07)
   goals met: 2 of 2
